config.org
#+EXPORT_FILE_NAME: readme
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

* Preamble
This is my private DOOM emacs configuration. It is tangled from ~config.org~ to ~config.el~
and is exported to ~readme.org~ with =,e O o= to render in the githup repo.
It is also rendered to HTML thanks to [[https://github.com/fniessen/org-html-themes][org-html-themes]] with =,e h h=

** Username and e-mail:
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Luca Cambiaghi"
      user-mail-address "luca.cambiaghi@me.com")
#+END_SRC
** Better defaults
#+BEGIN_SRC emacs-lisp
(setq-default
 uniquify-buffer-name-style 'forward              ; Uniquify buffer names
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      ;; auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      inhibit-compacting-font-caches t)           ; When there are lots of glyphs, keep them in memory

(delete-selection-mode 1)                         ; Replace selection when inserting text
;; (global-subword-mode 1)                           ; Iterate through CamelCase words
#+END_SRC

* Keybindings
Let's have ~general~ auto-unbind keys:
#+BEGIN_SRC emacs-lisp
(general-auto-unbind-keys)
#+END_SRC

We then remap some of the bindings (inspired by [[https://github.com/jsmestad/dfiles/blob/master/.doom.d/%2Bbindings.el#L496-L854][bindings.el]]).
#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "M-x"                   :n "SPC" #'counsel-M-x
      :desc "ivy resume" :n ":" #'ivy-resume
      :desc "Async shell command"   :n "!"   #'async-shell-command
      :desc "Toggle eshell"         :n "'"   #'+eshell/toggle
      :desc "Open dir in iTerm" :n "oi" #'+macos/open-in-iterm

      (:desc "windows" :prefix "w"
        :desc "popup raise" :n "p" #'+popup/raise)

      (:desc "project" :prefix "p"
        :desc "Eshell"               :n "'" #'projectile-run-eshell
        :desc "Terminal" :n "t" #'projectile-run-vterm ))

#+END_SRC

* User Interface
** Turn off line numbers
#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type nil)
#+END_SRC
** Font and font size:
Toggle ~big mode~ with =SPC t b=
#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "Menlo" :size 16)
      doom-big-font (font-spec :family "Menlo" :size 20))
;; (setq doom-font (font-spec :family "Fira Code" :size 14)
;;       doom-big-font (font-spec :family "Fira Code" :size 22)
;; doom-variable-pitch-font (font-spec :family "Overpass" :size 16))
#+END_SRC
** which-key delay
#+BEGIN_SRC emacs-lisp
(after! which-key
    (setq which-key-idle-delay 0.5))
#+END_SRC

** TODO Transparency
#+BEGIN_SRC emacs-lisp
;; (set-frame-parameter (selected-frame)'alpha '(98 . 98))
;; (add-to-list 'default-frame-alist'(alpha . (98 . 98)))
#+END_SRC
** Theme:
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-one)
#+END_SRC
** Fancy splash image
#+BEGIN_SRC emacs-lisp
(setq +doom-dashboard-banner-file
      (expand-file-name "splash-images/black-hole2.png" doom-private-dir))
#+END_SRC
** Centaur-tabs
#+BEGIN_SRC emacs-lisp
(after! centaur-tabs
  (setq centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker "M"
        centaur-tabs-cycle-scope 'tabs
        centaur-tabs-set-close-button nil)
  (centaur-tabs-group-by-projectile-project))
#+END_SRC
** Winum
note: insteadf of using =SPC 0=, use =SPC w h= to access its window. In general,
use those keys!
#+BEGIN_SRC emacs-lisp
(after! winum
  ;; (defun winum-assign-0-to-treemacs ()
  ;;   (when (string-match-p (buffer-name) "*Treemacs*") 10))

  ;; (add-to-list 'winum-assign-functions #'winum-assign-0-to-treemacs)
  ;; (set-face-attribute 'winum-face nil :weight 'bold)

    (map! (:when (featurep! :ui window-select)
            :leader
            :n "1" #'winum-select-window-1
            :n "2" #'winum-select-window-2
            :n "3" #'winum-select-window-3
        )))
#+END_SRC
** Pretty code
#+BEGIN_SRC emacs-lisp
(setq +pretty-code-enabled-modes '(org-mode))
#+END_SRC
** modeline
*** Hide undesired info
#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-env-enable-python nil))
;; (setq doom-modeline-env-python-executable (executable-find "python"))
#+END_SRC
*** Show battery and time
#+BEGIN_SRC emacs-lisp
(after! doom-modeline
    (setq display-time-default-load-average nil)      ; don't show load average
    (display-time-mode 1)                             ; Enable time in the mode-line
    (display-battery-mode 1))                          ; On laptops it's nice to know how much power you have
#+END_SRC
** Split window and move to it
#+BEGIN_SRC emacs-lisp
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+END_SRC
** Syntax highlighting
After ~doom sync~ you should run ~tree-sitter-install-grammars~
#+BEGIN_SRC emacs-lisp
(use-package tree-sitter :after python-mode)

(after! tree-sitter
  (require 'tree-sitter)
  (require 'tree-sitter-langs)
  (require 'tree-sitter-hl)
  (add-hook 'python-mode-hook #'tree-sitter-hl-mode))
#+END_SRC
** Toggle centered cursor
#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "toggle centered cursor"                   :n "t-" (λ! () (interactive) (centered-cursor-mode 'toggle))
      )
#+END_SRC


* Magit
#+BEGIN_SRC emacs-lisp
(after! magit
  ;; (magit-wip-mode)
  (setq magit-repository-directories '(("~/git" . 2))
        magit-save-repository-buffers nil
        ;; Don't restore the wconf after quitting magit
        magit-inhibit-save-previous-winconf t
        magit-log-arguments '("--graph" "--decorate" "--color")
        ;; magit-delete-by-moving-to-trash nil
        git-commit-summary-max-length 120))
#+END_SRC
* Company
** Delay, prefix length
#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-idle-delay 0.3
        company-minimum-prefix-length 1
  company-dabbrev-code-everywhere t
  company-dabbrev-code-other-buffers 'all))
        ;; company-quickhelp-delay 0.4)
#+END_SRC
** Backends
#+BEGIN_SRC emacs-lisp
(after! prescient
  (setq-default history-length 1000)
  (setq-default prescient-history-length 1000))

;; (add-hook 'after-init-hook 'company-statistics-mode))

;; (set-company-backend! 'org-mode
;;   '(company-capf company-files company-dabbrev-code))
(after! company
  (use-package company-tabnine :ensure t)
  (setq company-backends '(company-tabnine company-capf company-yasnippet)))

;; (after! company
;;   (add-to-list 'company-backends 'company-tabnine))
#+END_SRC
** TODO Interference with yasnippet
#+BEGIN_SRC emacs-lisp
;; (after! company
;;   (defun company-yasnippet-or-completion ()
;;     (interactive)
;;     (let ((yas-fallback-behavior nil))
;;       (unless (yas-expand)
;;         (call-interactively #'company-complete-common))))

;;   (add-hook 'company-mode-hook (lambda ()
;;                                  (substitute-key-definition 'company-complete-common
;;                                                             'company-yasnippet-or-completion
;;                                                             company-active-map))))
#+END_SRC

* Org
** Better defaults
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Dropbox/org"
      org-image-actual-width nil
      +org-export-directory "~/Dropbox/org/export"
      org-default-notes-file "~/Dropbox/org/personal/inbox.org"
      org-id-locations-file "~/Dropbox/org/.orgids"
      org-agenda-files (directory-files-recursively "~/Dropbox/org/" "\\.org$")
      ;; org-export-in-background t
      org-catch-invisible-edits 'smart)
#+END_SRC
** TODO Export
Load ~ox-ravel~:
#+BEGIN_SRC emacs-lisp
;; (load! "modules/ox-ravel")
#+END_SRC
This allows to export from ~.org~ to ~.Rmd~
** Capture templates
#+BEGIN_SRC emacs-lisp
(after! org

  (setq org-capture-templates
                  '(("d" "Diary")
                    ("u" "URL")))

  (add-to-list 'org-capture-templates
             '("dn" "New Diary Entry" entry(file+olp+datetree"~/git/Dropbox/org/personal/diary.org" "Daily Logs")
"* %^{thought for the day}
:PROPERTIES:
:CATEGORY: %^{category}
:SUBJECT:  %^{subject}
:MOOD:     %^{mood}
:END:
:RESOURCES:
:END:

\*What was one good thing you learned today?*:
- %^{whatilearnedtoday}

\*List one thing you could have done better*:
- %^{onethingdobetter}

\*Describe in your own words how your day was*:
- %?"))

  (add-to-list 'org-capture-templates
      '("un" "New URL Entry" entry(file+function "~/Dropbox/org/personal/dailies.org" org-reverse-datetree-goto-date-in-file)
            "* [[%^{URL}][%^{Description}]] %^g %?")))
#+END_SRC
** Prettify
*** Bullets
#+BEGIN_SRC emacs-lisp
(after! org-superstar
    (setq org-superstar-headline-bullets-list '("✖" "✚" "◆" "▶" "○")
        org-ellipsis "▼"))
#+END_SRC
*** TODO Tables
#+BEGIN_SRC emacs-lisp
;; (setq global-org-pretty-table-mode t)
#+END_SRC
