config.org
*** TODO Pretty mode
#+BEGIN_SRC emacs-lisp
;; (add-hook! 'org-mode-hook #'+org-pretty-mode)
#+END_SRC
** Org agenda popup
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "*org agenda*" :side 'right :size .40 :select t :vslot 2 :ttl 3)
#+END_SRC
** ox-ipynb
#+BEGIN_SRC emacs-lisp
(require 'ox-ipynb)
#+END_SRC
** Org babel clojure
#+BEGIN_SRC emacs-lisp
(after! evil-org
  (setq org-babel-clojure-backend 'cider))
#+END_SRC
** Reveal
#+BEGIN_SRC emacs-lisp
(after! org-re-reveal
(setq org-re-reveal-root "./reveal.js")
  )
#+END_SRC

** org-cv
#+BEGIN_SRC emacs-lisp
(after! evil-org
    (use-package ox-moderncv
        :load-path "/Users/luca/git/org-cv/"
        :init (require 'ox-altacv))
        ;; :init (require 'ox-moderncv))
    )
#+END_SRC
** Use xelatex
#+BEGIN_SRC emacs-lisp
(after! latex
    (setq org-latex-compiler "xelatex"))
#+END_SRC

* emacs-jupyter
** Org default header arguments:
#+BEGIN_SRC emacs-lisp
(after! evil-org
  (setq org-babel-default-header-args:jupyter-python '((:async . "yes")
                                                       (:pandoc t)
                                                       (:kernel . "python3")))
  (setq org-babel-default-header-args:jupyter-R '((:pandoc t)
                                                  (:kernel . "ir"))))
#+END_SRC
** Key bindings:
#+BEGIN_SRC emacs-lisp
;; (:when (featurep! :lang +jupyter)
(map! :after evil-org
      :map evil-org-mode-map
      :leader
      :desc "tangle" :n "ct" #'org-babel-tangle
      :localleader
      :desc "Hydra" :n "," #'jupyter-org-hydra/body
      :desc "Inspect at point" :n "?" #'jupyter-inspect-at-point
      :desc "Execute and step" :n "RET" #'jupyter-org-execute-and-next-block
      :desc "Delete code block" :n "x" #'jupyter-org-kill-block-and-results
      :desc "New code block above" :n "+" #'jupyter-org-insert-src-block
      :desc "New code block below" :n "=" (λ! () (interactive) (jupyter-org-insert-src-block t nil))
      :desc "Merge code blocks" :n "m" #'jupyter-org-merge-blocks
      :desc "Split code block" :n "-" #'jupyter-org-split-src-block
      :desc "Fold results" :n "z" #'org-babel-hide-result-toggle

      :map org-src-mode-map
      :localleader
      :desc "Exit edit" :n "'" #'org-edit-src-exit)

(map! :after python
      :map python-mode-map
      :localleader
      (:desc "eval" :prefix "e"
       :desc "line or region" :n "e" #'jupyter-eval-line-or-region
        :desc "defun" :n "d" #'jupyter-eval-defun
       :desc "buffer" :n "b" #'jupyter-eval-buffer))
#+END_SRC
** Popups
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "*jupyter-pager*" :side 'right :size .40 :select t :vslot 2 :ttl 3)
(set-popup-rule! "^\\*Org Src*" :side 'right :size .60 :select t :vslot 2 :ttl 3 :quit nil)
(set-popup-rule! "*jupyter-repl*" :side 'bottom :size .30 :vslot 2 :ttl 3)
#+END_SRC
** Library of babel
#+BEGIN_SRC emacs-lisp
(after! evil-org
  (org-babel-lob-ingest "/Users/luca/git/experiments/literate/ml/rpy2.org"))
#+END_SRC
** Eval handler
With ~g r~ we can send code to the Jupyter REPL:
#+BEGIN_SRC emacs-lisp
(after! jupyter
  (set-eval-handler! 'jupyter-repl-interaction-mode #'jupyter-eval-line-or-region))
#+END_SRC

** Set REPL handler
On a scratch buffer, first run ~jupyter-associate-buffer~.
Then, hitting ~SPC o r~ allows use to hit the REPL buffer with the lines/regions
of code we send with ~g r~.
#+BEGIN_SRC emacs-lisp
(add-hook! python-mode
  (set-repl-handler! 'python-mode #'jupyter-repl-pop-to-buffer))
#+END_SRC
** Use overlays
Evaluate simple expressions to the right of the symbol with =, e e=
#+BEGIN_SRC emacs-lisp
(after! jupyter
  (setq jupyter-eval-use-overlays t))
#+END_SRC
** TODO Long outputs
#+BEGIN_SRC emacs-lisp
(after! jupyter
  (cl-defmethod jupyter-org--insert-result (_req context result)
    (let ((str
           (org-element-interpret-data
            (jupyter-org--wrap-result-maybe
             context (if (jupyter-org--stream-result-p result)
                         (thread-last result
                           jupyter-org-strip-last-newline
                           jupyter-org-scalar)
                       result)))))
      (if (< (length str) 10000)
          (insert str)
        (insert (format ": Result was too long! Length was %d" (length str)))))
    (when (/= (point) (line-beginning-position))
      ;; Org objects such as file links do not have a newline added when
      ;; converting to their string representation by
      ;; `org-element-interpret-data' so insert one in these cases.
      (insert "\n"))))
#+END_SRC

** TODO Bigger inline images
#+BEGIN_SRC emacs-lisp
;; (setq org-image-actual-width t)
#+END_SRC
** Fix zmq keywords
#+BEGIN_SRC emacs-lisp
(defadvice! fixed-zmq-start-process (orig-fn &rest args)
  :around #'zmq-start-process
  (letf! (defun make-process (&rest plist)
           (plist-put! plist :coding (plist-get plist :coding-system))
           (plist-delete! plist :coding-system)
           (apply make-process plist))
    (apply orig-fn args)))
#+END_SRC

* Python
** REPL
*** virtualenv executable
#+BEGIN_SRC emacs-lisp
(defadvice! +python-poetry-open-repl-a (orig-fn &rest args)
  "Use the Python binary from the current virtual environment."
  :around #'+python/open-repl
  (if (getenv "VIRTUAL_ENV")
      (let ((python-shell-interpreter (executable-find "ipython")))
        (apply orig-fn args))
    (apply orig-fn args)))
#+END_SRC
*** Silence warnings when opening REPL
#+BEGIN_SRC emacs-lisp
(setq python-shell-prompt-detect-failure-warning nil)
#+END_SRC
*** Ignore popup rule
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "^\\*Python*" :ignore t)
#+END_SRC
*** Disable native completion
#+BEGIN_SRC emacs-lisp
(after! python
  (setq python-shell-completion-native-enable nil))
#+END_SRC

** LSP
*** Use lsp-python-ms
#+BEGIN_SRC emacs-lisp
(after! lsp-python-ms
  (set-lsp-priority! 'mspyls 1))
#+END_SRC
*** TODO Use pyright
#+BEGIN_SRC emacs-lisp
;; (setq lsp-pyright-server-cmd '("pyright-langserver"
;;                                "--stdio"))

;; (after! lsp-mode
;;   (lsp-register-client
;;    (make-lsp-client
;;     :new-connection (lsp-stdio-connection
;;                      (lambda () lsp-pyright-server-cmd)
;;                      (lambda ()
;;                        (and (cl-first lsp-pyright-server-cmd)
;;                             (executable-find (cl-first lsp-pyright-server-cmd)))))
;;     :major-modes '(python-mode)
;;     :server-id 'mspyright
;;     :priority 1
;;     :initialized-fn (lambda (workspace)
;;                       (with-lsp-workspace workspace
;;                         (lsp--set-configuration (lsp-configuration-section "python"))))
;;     :notification-handlers (lsp-ht ("pyright/beginProgress" 'ignore)
;;                                    ("pyright/reportProgress" 'ignore)
;;                                    ("pyright/endProgress" 'ignore))))
;;   )
#+END_SRC

*** Don't guess project root
In case we get a wrong workspace root, we can delete it with ~lsp-workspace-folders-remove~
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (setq lsp-auto-guess-root nil))
#+END_SRC

#+begin_src emacs-lisp
(after! projectile
  (setq projectile-project-root-files '("Dockerfile" "pyproject.toml" "project.clj")))
#+end_src

*** Increase bytes read from subprocess
#+BEGIN_SRC emacs-lisp
(setq read-process-output-max (* 1024 1024))
#+END_SRC
*** TODO LSP idle delay
This variable determines how often lsp-mode will refresh the highlights, lenses, links, etc while you type.
#+BEGIN_SRC emacs-lisp
;; (after! lsp-mode
;;   (setq lsp-idle-delay 0.500))
#+END_SRC
*** TODO Prefer company-capf over company-lsp
#+BEGIN_SRC emacs-lisp
;; (setq +lsp-company-backend 'company-capf)
#+END_SRC
*** lsp-help popup
Lookup documentation with ~SPC c k~
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "^\\*lsp-help" :side 'right :size .50 :select t :vslot 1)
#+END_SRC
*** TODO Missing imports
In python mode, use ~, i i~ to add missing imports
#+BEGIN_SRC emacs-lisp
;; (after! pyimport
;;   (setq pyimport-pyflakes-path "~/git/experiments/.venv/bin/pyflakes"))
#+END_SRC
*** TODO Use flymake instead of flycheck
#+BEGIN_SRC emacs-lisp
;; (after! lsp-mode
;;   (setq lsp-diagnostic-package :flymake))

;; (after! lsp-mode
;;   (add-hook! python-mode (setq lsp-diagnostic-package :flymake)))

;; (after! python
;;   (setq python-flymake-command  "~/git/experiments/.venv/bin/pyflakes"))

;; (after! flycheck
;;   (setq-default flycheck-checker 'python-pylint))
#+END_SRC
*** Disable lsp flycheck checker
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (setq lsp-diagnostic-package :none))
  ;; (setq flycheck-disabled-checkers 'lsp)
#+END_SRC

*** UI
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (setq lsp-eldoc-enable-hover nil
        lsp-signature-auto-activate nil
        ;; lsp-enable-on-type-formatting nil
        lsp-enable-symbol-highlighting nil))
        ;; lsp-enable-file-watchers nil))
#+END_SRC
*** Don't restart on exit
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (setq lsp-restart 'ignore))
#+END_SRC

** Pytest
#+BEGIN_SRC emacs-lisp
(after! python-pytest
  (setq python-pytest-arguments '("--color" "--failed-first"))
  (evil-set-initial-state 'python-pytest-mode 'normal))

(set-popup-rule! "^\\*pytest*" :side 'right :size .50)
#+END_SRC
** dap-mode
