config.org
** Syntax highlighting
#+BEGIN_SRC emacs-lisp
(after! ess
  (setq ess-R-font-lock-keywords '((ess-R-fl-keyword:keywords . t)
                                   (ess-R-fl-keyword:constants . t)
                                   (ess-R-fl-keyword:modifiers . t)
                                   (ess-R-fl-keyword:fun-defs . t)
                                   (ess-R-fl-keyword:assign-ops . t)
                                   (ess-R-fl-keyword:%op% . t)
                                   (ess-fl-keyword:fun-calls . t)
                                   (ess-fl-keyword:numbers . t)
                                   (ess-fl-keyword:operators . t)
                                   (ess-fl-keyword:delimiters . t)
                                   (ess-fl-keyword:= . t)
                                   (ess-R-fl-keyword:F&T . t))))
#+END_SRC

** Pretty symbols
#+BEGIN_SRC emacs-lisp
(after! ess-r-mode
  (appendq! +pretty-code-symbols
            '(:assign "⟵"
              :multiply "×"))
  (set-pretty-symbols! 'ess-r-mode
    ;; Functional
    :def "function"
    ;; Types
    :null "NULL"
    :true "TRUE"
    :false "FALSE"
    :int "int"
    :floar "float"
    :bool "bool"
    ;; Flow
    :not "!"
    :and "&&" :or "||"
    :for "for"
    :in "%in%"
    :return "return"
    ;; Other
    :assign "<-"
    :multiply "%*%"))
#+END_SRC
* Clojure
** TODO Use flycheck
#+BEGIN_SRC emacs-lisp
;; (after! lsp-mode
;;   (add-hook! clojure-mode (setq lsp-diagnostic-package :flycheck)))
#+END_SRC
** Company keybingins
#+BEGIN_SRC emacs-lisp
(after! cider
  (add-hook 'company-completion-started-hook 'custom/set-company-maps)
  (add-hook 'company-completion-finished-hook 'custom/unset-company-maps)
  (add-hook 'company-completion-cancelled-hook 'custom/unset-company-maps)

  (defun custom/unset-company-maps (&rest unused)
    "Set default mappings (outside of company).
    Arguments (UNUSED) are ignored."
    (general-def
      :states 'insert
      :keymaps 'override
      "<down>" nil
      "<up>"   nil
      "RET"    nil
      [return] nil
      "C-n"    nil
      "C-p"    nil
      "C-j"    nil
      "C-k"    nil
      "C-h"    nil
      "C-u"    nil
      "C-d"    nil
      "C-s"    nil
      "C-S-s"   (cond ((featurep! :completion helm) nil)
                      ((featurep! :completion ivy)  nil))
      "C-SPC"   nil
      "TAB"     nil
      [tab]     nil
      [backtab] nil))

  (defun custom/set-company-maps (&rest unused)
    "Set maps for when you're inside company completion.
    Arguments (UNUSED) are ignored."
    (general-def
      :states 'insert
      :keymaps 'override
      "<down>" #'company-select-next
      "<up>" #'company-select-previous
      "RET" #'company-complete
      [return] #'company-complete
      "C-w"     nil           ; don't interfere with `evil-delete-backward-word'
      "C-n"     #'company-select-next
      "C-p"     #'company-select-previous
      "C-j"     #'company-select-next
      "C-k"     #'company-select-previous
      "C-h"     #'company-show-doc-buffer
      "C-u"     #'company-previous-page
      "C-d"     #'company-next-page
      "C-s"     #'company-filter-candidates
      "C-S-s"   (cond ((featurep! :completion helm) #'helm-company)
                      ((featurep! :completion ivy)  #'counsel-company))
      "C-SPC"   #'company-complete-common
      "TAB"     #'company-complete-common-or-cycle
      [tab]     #'company-complete-common-or-cycle
      [backtab] #'company-select-previous    ))
  )
#+END_SRC
** REPL keybindings
#+BEGIN_SRC emacs-lisp
(add-hook! cider-repl-mode #'evil-normalize-keymaps)
#+END_SRC

** Cleverparens
#+BEGIN_SRC emacs-lisp
(after! smartparens
  ;; (add-hook! clojure-mode #'smartparens-strict-mode)

  (setq evil-cleverparens-use-s-and-S nil)

  (use-package! evil-cleverparens
    :init
    (setq evil-move-beyond-eol t
          evil-cleverparens-use-additional-bindings nil
          ;; evil-cleverparens-swap-move-by-word-and-symbol t
          ;; evil-cleverparens-use-regular-insert t
          )

    (add-hook! clojure-mode #'evil-cleverparens-mode)
    ;; (add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
    ))
#+END_SRC
** Aggressive indent
#+BEGIN_SRC emacs-lisp
(after! clojure-mode
  (use-package! aggressive-indent
    :config (add-hook! clojure-mode (aggressive-indent-mode 1))))
#+END_SRC
** Cleverparens keybindings
With ~lispyville~ you can wrap using =M-(= for example!
#+BEGIN_SRC emacs-lisp
(map! :after evil-cleverparens
      :map clojure-mode-map
      :localleader
      (:desc "Wrap round" :n "(" #'sp-wrap-round
       :desc "Wrap square" :n "[" #'sp-wrap-square
       :desc "Wrap curly" :n "{" #'sp-wrap-curly
       :desc "Unwrap sexp" :n "u" #'sp-unwrap-sexp
       ))
#+END_SRC
** TODO Lispyville
#+BEGIN_SRC emacs-lisp
;; (after! lispyville
;;   (setq lispyville-key-theme
;;         '((operators normal)
;;           ;; c-w
;;           (prettify insert)
;;           (atom-movement normal visual)
;;           slurp/barf-lispy
;;           additional
;;           ;; additional-insert
;;           additional-wrap
;;           additional-motions))

;;   ;; (setq lispyville-motions-put-into-special t)

;;   (map! :mode lispy-mode
;;         :after lispyville
;;         ;; :i "M-[" #'lispy-brackets
;;         :n "[" #'lispyville-previous-opening
;;         :n "]" #'lispyville-next-opening)

;;   (map! :map lispy-mode-map
;;         :after lispyville
;;         :i "[" #'lispy-brackets)

;;   ;; (map! :map evil-motion-state-map
;;   ;;         :n "[[" #'lispyville-previous-opening)
;;   )
#+END_SRC

** TODO Vega view
#+BEGIN_SRC emacs-lisp
;; (after! cider
;;   (use-package! vega-view
;;     :init
;;     (setq vega-view-prefer-png t)))
#+END_SRC
** nREPL timeout
#+BEGIN_SRC emacs-lisp
(after! cider
 (setq nrepl-sync-request-timeout nil))
#+END_SRC
** Align vertically automatically
#+BEGIN_SRC emacs-lisp
(after! clojure-mode
  (setq clojure-align-forms-automatically t))
#+END_SRC

