config.el
;;   (eval-after-load 'clojure-mode
;;     '(sayid-setup-package)))

;; (use-package sayid
;;     :defer t
;;     :init
;;     (progn
;;       (setq sayid--key-binding-prefixes
;;             '(("mdt" . "trace")))
;;       (spacemacs|forall-clojure-modes m
;;         (mapc (lambda (x) (spacemacs/declare-prefix-for-mode m
;;                             (car x) (cdr x)))
;;               sayid--key-binding-prefixes)
;;         (spacemacs/set-leader-keys-for-major-mode m
;;           ;;These keybindings mostly preserved from the default sayid bindings
;;           "d!" 'sayid-load-enable-clear
;;           "dE" 'sayid-eval-last-sexp ;in default sayid bindings this is lowercase e, but that was already used in clojure mode
;;           "dc" 'sayid-clear-log
;;           "df" 'sayid-query-form-at-point
;;           "dh" 'sayid-show-help
;;           "ds" 'sayid-show-traced
;;           "dS" 'sayid-show-traced-ns
;;           "dtb" 'sayid-trace-ns-in-file
;;           "dtd" 'sayid-trace-fn-disable
;;           "dtD" 'sayid-trace-disable-all
;;           "dte" 'sayid-trace-fn-enable
;;           "dtE" 'sayid-trace-enable-all
;;           "dtK" 'sayid-kill-all-traces
;;           "dtn" 'sayid-inner-trace-fn
;;           "dto" 'sayid-outer-trace-fn
;;           "dtp" 'sayid-trace-ns-by-pattern
;;           "dtr" 'sayid-remove-trace-fn
;;           "dty" 'sayid-trace-all-ns-in-dir
;;           "dV" 'sayid-set-view
;;           "dw" 'sayid-get-workspace
;;           "dx" 'sayid-reset-workspace
;;           ))

;;       (evilified-state-evilify sayid-mode sayid-mode-map
;;         (kbd "H") 'sayid-buf-show-help
;;         (kbd "n") 'sayid-buffer-nav-to-next
;;         (kbd "N") 'sayid-buffer-nav-to-prev
;;         (kbd "C-s v") 'sayid-toggle-view
;;         (kbd "C-s V") 'sayid-set-view
;;         (kbd "L") 'sayid-buf-back
;;         (kbd "e") 'sayid-gen-instance-expr) ;Originally this was bound to 'g', but I feel this is still mnemonic and doesn't overlap with evil

;;       (evilified-state-evilify sayid-pprint-mode sayid-pprint-mode-map
;;         (kbd "h") 'sayid-pprint-buf-show-help
;;         (kbd "n") 'sayid-pprint-buf-next
;;         (kbd "N") 'sayid-pprint-buf-prev
;;         (kbd "l") 'sayid-pprint-buf-exit)

;;       (evilified-state-evilify sayid-traced-mode sayid-traced-mode-map
;;         (kbd "l") 'sayid-show-traced
;;         (kbd "h") 'sayid-traced-buf-show-help)))

(map! :after cider
      :map clojure-mode-map
      :localleader
      (:desc "eval" :prefix "e"
       :desc "sexp in comment" :n "E" #'cider-pprint-eval-last-sexp-to-comment
       :desc "defun in comment" :n "D" #'cider-pprint-eval-defun-to-comment
       ))

(defun shell-command-print-separator ()
  (overlay-put (make-overlay (point-max) (point-max))
               'before-string
               (propertize "!" 'display
                           (list 'left-fringe
                                 'right-triangle))))

(advice-add 'shell-command--save-pos-or-erase :after 'shell-command-print-separator)

  (set-popup-rule! "*Async Shell Command*" :side 'bottom :size .40)
  (set-popup-rule! "vterm" :side 'right :size .40 :quit 'current)

;; (after! counsel
  ;; :config
  ;; Thanks to https://github.com/kaushalmodi/.emacs.d/blob/master/setup-files/setup-counsel.el
  ;; (setq counsel-rg-base-command "rg --with-filename --no-heading --line-number --hidden --color never %s"))
  ;; (setq counsel-rg-base-command (concat counsel-rg-base-command " --hidden")))
